Revit 2027 API
FabricationPartSizeMap(String, Double, Double, Boolean) Constructor
 Creates a new instance of the FabricationPartSizeMap class.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationPartSizeMap(
	string size,
	double widthDiameter,
	double depth,
	bool isProductList
)
Public Sub New (
	size As String,
	widthDiameter As Double,
	depth As Double,
	isProductList As Boolean
)
public:
FabricationPartSizeMap(
	String^ size,
	double widthDiameter,
	double depth,
	bool isProductList
)
new :
        size : string *
        widthDiameter : float *
        depth : float *
        isProductList : bool -> FabricationPartSizeMap
Parameters
size String
 The size display string for the straight that can be used by the user interface.
widthDiameter Double
 The width or diameter of the straight.
depth Double
 The depth of the straight.
isProductList Boolean
 Set if the straight a product list or not.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationPartSizeMap Class
FabricationPartSizeMap Overload
Autodesk.Revit.DB.Fabrication Namespace